Implement Basic Libraries of Python such as Statistics, Math, Numpy, Sys and Scipy. (Using Marksheet Dataset)

In [4]:
import numpy as np
import statistics as stats
from sklearn.datasets import load_iris
from scipy import stats as scipy_stats
import math
import sys
import pandas as pd

In [10]:
data = pd.read_csv('./data/marksheet.csv')
data.head()

   id     Name  Gender  Age Section  Science  English  History  Maths
0   1  Bronnie  Female   13       C       21       81       62     49
1   2   Lemmie    Male   15       B       29       41       17     40
2   3    Danya  Female   14       C       12       87       16     96
3   4    Denna  Female   14       B       15       53       82     33
4   5  Jocelin    Male   14       A       43        6        3     21

In [11]:
df = pd.DataFrame(data)

In [12]:
df.describe()

               id         Age     Science     English     History       Maths
count  250.000000  250.000000  250.000000  250.000000  250.000000  250.000000
mean   125.500000   14.020000   51.440000   47.980000   52.272000   53.016000
std     72.312977    0.823598   29.314497   29.949013   26.868526   27.386416
min      1.000000   13.000000    1.000000    1.000000    1.000000    1.000000
25%     63.250000   13.000000   25.250000   20.250000   31.000000   30.000000
50%    125.500000   14.000000   53.000000   47.500000   53.000000   52.500000
75%    187.750000   15.000000   78.000000   74.000000   76.000000   76.000000
max    250.000000   15.000000  100.000000  100.000000  100.000000  100.000000

In [14]:
df.max()

id           250
Name       Zenia
Gender      Male
Age           15
Section        C
Science      100
English      100
History      100
Maths        100
dtype: object

In [15]:
df.min()

id              1
Name         Abel
Gender     Female
Age            13
Section         A
Science         1
English         1
History         1
Maths           1
dtype: object

In [17]:
df['Science'].std()

29.314497420835046

In [18]:
df['Science'].var()

859.3397590361446